Repository: HSQ-Q/kube-MSRM
Catalog: translations/kubectl/*/LC_MESSAGES/k8s.po
Languages: pt_br

source: Create a secret based on a file, directory, or specified literal value. A single secret may package one or more key/value pairs. When creating a secret based on a file, the key will default to the basename of the file, and the value will default to the file content. If the basename is an invalid key, you may specify an alternate key. When creating a secret based on a directory, each file whose basename is a valid key in the directory will be packaged into the secret. Any directory entries except regular files are ignored (e.g. subdirectories, symlinks, devices, pipes, etc).
pt_br: Cria um secret com base em um arquivo, diretório, ou um valor literal especificado. Um secret único pode conter um ou mais pares de chave/valor. Quando criar um secret com base em um arquivo, a chave será por padrão o nome do arquivo, e o valor será por padrão o conteúdo do arquivo. Se o nome do arquivo for uma chave inválida, você deve especificar uma chave alternativa. Quando criar um secret com base em um diretório, cada arquivo cujo o nome é uma chave válida no diretório será colocada no configmap. Qualquer entrada de diretório, exceto as com arquivos válidos serão ignorados (por exemplo: sub-diretórios, symlinks, devices, pipes, etc).

source: Create a service account with the specified name.
pt_br: Cria uma conta de serviço com um nome especificado.

source: Create and run a particular image, possibly replicated. Creates a deployment or job to manage the created container(s).
pt_br: Cria e executa uma imagem específica, possivelmente replicada. Cria um deployment ou job para gerenciar o(s) container(s) criado(s).

source: Creates an autoscaler that automatically chooses and sets the number of pods that run in a kubernetes cluster. Looks up a Deployment, ReplicaSet, or ReplicationController by name and creates an autoscaler that uses the given resource as a reference. An autoscaler can automatically increase or decrease number of pods deployed within the system as needed.
pt_br: Cria um autoscaler que automaticamente escolhe e configura quantos pods irão executar em um cluster kubernetes. Procura por um Deployment, ReplicaSet, ou ReplicationController por nome e cria um autoscaler que utiliza o recurso fornecido como referência. Um autoscaler pode automaticamente aumentar ou reduzir o número de pods quando necessário.

source: Display Resource (CPU/Memory/Storage) usage of nodes. The top-node command allows you to see the resource consumption of nodes.
pt_br: Mostra os Recursos (CPU/Memória/Armazenamento) utilizados nos nodes. O comando top-node permite que você veja o consumo de recursos dos nodes.

source: Display Resource (CPU/Memory/Storage) usage of pods. The 'top pod' command allows you to see the resource consumption of pods. Due to the metrics pipeline delay, they may be unavailable for a few minutes since pod creation.
pt_br: Mostra a utilização de recursos dos pods (CPU/Memória/Armazenamento). O comando 'top pod' deixa você ver a utilização dos recusrsos dos pods. Devido ao atraso da pipeline de métricas, o resultado pode estar indisponível por alguns minutos desde a criação do pod.

source: Display Resource (CPU/Memory/Storage) usage. The top command allows you to see the resource consumption for nodes or pods. This command requires Heapster to be correctly configured and working on the server.
pt_br: Mostra a utilização de recursos (CPU/Memória/Armazenamento). O comando top deixa você ver a utilização de recursos de nodes e pods. Este comando necessita que o Heapster esteja corretamente configurado e rodando no servidor.

source: Mark node as schedulable.
pt_br: Remove a restrição de execução de workloads no node.

source: Mark node as unschedulable.
pt_br: Aplica a restrição de execução de workloads no node.

source: Perform a rolling update of the given ReplicationController. Replaces the specified replication controller with a new replication controller by updating one pod at a time to use the new PodTemplate. The new-controller.json must specify the same namespace as the existing replication controller and overwrite at least one (common) label in its replicaSelector. ![Workflow](http://kubernetes.io/images/docs/kubectl_rollingupdate.svg)
pt_br: Aplica uma atualização contínua em um ReplicationController. Troca o replication controller especificado por um novo replication controller atualizando um pod por vez para utilizar o novo PodTemplate. O new-controller.json deve ser especificado no mesmo namespace que o replication controller existente e sobrescrever pelo menos uma label comum no seu replicaSelector. ![Workflow](http://kubernetes.io/images/docs/kubectl_rollingupdate.svg)

source: Replace a resource by filename or stdin. JSON and YAML formats are accepted. If replacing an existing resource, the complete resource spec must be provided. This can be obtained by $ kubectl get TYPE NAME -o yaml Please refer to the models in https://htmlpreview.github.io/?https://github.com/kubernetes/kubernetes/blob/HEAD/docs/api-reference/v1/definitions.html to find if a field is mutable.
pt_br: Substitui um recurso pelo especificado em um arquivo ou via stdin. Os formatos JSON and YAML são aceitos. Quando substituindo recursos existentes, a especificação completa do recurso deve ser fornecida. Isto pode ser obtido com $ kubectl get TYPE NAME -o yaml Consulte os modelos em https://htmlpreview.github.io/?https://github.com/kubernetes/kubernetes/blob/HEAD/docs/api-reference/v1/definitions.html para descobrir se um campo é mutável.

source: Set a new size for a Deployment, ReplicaSet, Replication Controller, or Job. Scale also allows users to specify one or more preconditions for the scale action. If --current-replicas or --resource-version is specified, it is validated before the scale is attempted, and it is guaranteed that the precondition holds true when the scale is sent to the server.
pt_br: Define um novo tamanho para um Deployment, ReplicaSet, Replication Controller, ou Job. Scale deixa os usuários especificar uma ou mais pre-condições para a ação de scale. Se --current-replicas ou --resource-version forem especificados, será validado antes da tentativa de scale, e garante que a pre-condição é verdadeira quando o scale é enviado para o servidor.

source: Set the latest last-applied-configuration annotations by setting it to match the contents of a file. This results in the last-applied-configuration being updated as though 'kubectl apply -f <file>' was run, without updating any other parts of the object.
pt_br: Define a annotation last-applied-configuration configurando para ser igual ao conteúdo do arquivo. Isto resulta no last-applied-configuration ser atualizado quando o 'kubectl apply -f <file>' executa, não atualizando as outras partes do objeto.

source: To proxy all of the kubernetes api and nothing else, use: $ kubectl proxy --api-prefix=/ To proxy only part of the kubernetes api and also some static files: $ kubectl proxy --www=/my/files --www-prefix=/static/ --api-prefix=/api/ The above lets you 'curl localhost:8001/api/v1/pods'. To proxy the entire kubernetes api at a different root, use: $ kubectl proxy --api-prefix=/custom/ The above lets you 'curl localhost:8001/custom/api/v1/pods'
pt_br: Para fazer o proxy the todas as apis do kubernetes, utilize: $ kubectl proxy —api-prefix=/ Para fazer o proxy de parte da api do kubernetes e alguns arquivos estáticos: $ kubectl proxy —www=/my/files —www-prefix=/static/ —api-prefix=/api/ Com os comandos acima você pode fazer 'curl localhost:8001/api/v1/pods'. Para fazer o proxy the todas as apis do kubernetes em um caminho diferente, utilize: $ kubectl proxy —api-prefix=/custom/ Com o comando acima você pode fazer 'curl localhost:8001/custom/api/v1/pods'

source: Update field(s) of a resource using strategic merge patch JSON and YAML formats are accepted. Please refer to the models in https://htmlpreview.github.io/?https://github.com/kubernetes/kubernetes/blob/HEAD/docs/api-reference/v1/definitions.html to find if a field is mutable.
pt_br: Atualiza o(s) campo(s) de um recurso usando strategic merge patch Formatos JSON e YAML são aceitos. Consulte os modelos em https://htmlpreview.github.io/?https://github.com/kubernetes/kubernetes/blob/HEAD/docs/api-reference/v1/definitions.html para descobrir se um campo é mutável.

source: Update the labels on a resource. * A label must begin with a letter or number, and may contain letters, numbers, hyphens, dots, and underscores, up to %[1]d characters. * If --overwrite is true, then existing labels can be overwritten, otherwise attempting to overwrite a label will result in an error. * If --resource-version is specified, then updates will use this resource version, otherwise the existing resource-version will be used.
pt_br: Atualiza labels em um recurso. * Um label deve começar com uma letra ou número, e pode conter letra, números, hífens, pontos e sublinhados, com no máximo %[1]d caracteres. * Se --overwrite for verdadeiro, então labels podem ser sobreescritos, caso contrário a sobreescrita irá falhar. * Se --resource-version for especificado, então as atualizações usarão esta versão do recurso, caso contrário, a versão do recurso existente será usada.

source: Update the taints on one or more nodes. * A taint consists of a key, value, and effect. As an argument here, it is expressed as key=value:effect. * The key must begin with a letter or number, and may contain letters, numbers, hyphens, dots, and underscores, up to %[1]d characters. * The value must begin with a letter or number, and may contain letters, numbers, hyphens, dots, and underscores, up to %[2]d characters. * The effect must be NoSchedule, PreferNoSchedule or NoExecute. * Currently taint can only apply to node.
pt_br: Atualiza os taints em um ou mais nodes. * Um taint consiste em uma chave, valor e efeito. Como arqgumento, é expressado como chave=valor:efeito. * Uma chave deve começar com uma letra ou número, e pode conter letras, números, hífens, pontos e sublinhados, com no máximo %[1]d caractéres. * Um valor deve começar com uma letra ou número, e pode conter letras, números, hífens, pontos e sublinhados, com no máximo %[2]d caractéres. * O efeito deve ser NoSchedule, PreferNoSchedule ou NoExecute. * Atualmente taint pode ser aplicado apenas para nodes.

source: # !!!Important Note!!! # Requires that the 'tar' binary is present in your container # image. If 'tar' is not present, 'kubectl cp' will fail. # Copy /tmp/foo_dir local directory to /tmp/bar_dir in a remote pod in the default namespace kubectl cp /tmp/foo_dir <some-pod>:/tmp/bar_dir # Copy /tmp/foo local file to /tmp/bar in a remote pod in a specific container kubectl cp /tmp/foo <some-pod>:/tmp/bar -c <specific-container> # Copy /tmp/foo local file to /tmp/bar in a remote pod in namespace <some-namespace> kubectl cp /tmp/foo <some-namespace>/<some-pod>:/tmp/bar # Copy /tmp/foo from a remote pod to /tmp/bar locally kubectl cp <some-namespace>/<some-pod>:/tmp/foo /tmp/bar
pt_br: # !!!Nota Importante!!! # Necessita que o binário 'tar' esteja presente na imagem do # container. Se 'tar' não estiver presente, o 'kubectl cp' irá falhar. # Copia o diretório local /tmp/foo_dir para /tmp/bar_dir no pod remoto no namespace default kubectl cp /tmp/foo_dir <some-pod>:/tmp/bar_dir # Copia o arquivo local /tmp/foo para /tmp/bar no pod remoto no container específico kubectl cp /tmp/foo <some-pod>:/tmp/bar -c <specific-container> # Copia o arquivo local /tmp/foo para /tmp/bar no pod remoto no namespace <some-namespace> kubectl cp /tmp/foo <some-namespace>/<some-pod>:/tmp/bar # Copia /tmp/foo do pod remoto para /tmp/bar localmente kubectl cp <some-namespace>/<some-pod>:/tmp/foo /tmp/bar

source: # Create a new TLS secret named tls-secret with the given key pair: kubectl create secret tls tls-secret --cert=path/to/tls.cert --key=path/to/tls.key
pt_br: # Cria um novo segredo TLS chamado tls-secret com o par the chaves fornecido: kubectl create secret tls tls-secret —cert=path/to/tls.cert —key=path/to/tls.key

source: # Create a new namespace named my-namespace kubectl create namespace my-namespace
pt_br: # Cria um novo namespace chamado my-namespace kubectl create namespace my-namespace

source: # Create a new secret named my-secret with keys for each file in folder bar kubectl create secret generic my-secret --from-file=path/to/bar # Create a new secret named my-secret with specified keys instead of names on disk kubectl create secret generic my-secret --from-file=ssh-privatekey=~/.ssh/id_rsa --from-file=ssh-publickey=~/.ssh/id_rsa.pub # Create a new secret named my-secret with key1=supersecret and key2=topsecret kubectl create secret generic my-secret --from-literal=key1=supersecret --from-literal=key2=topsecret
pt_br: # Cria um novo segredo chamado my-secret com as chaves para cada arquivo no diretório bar kubectl create secret generic my-secret --from-file=path/to/bar # Cria um novo segredo chamado my-secret com chaves especificadas em vez dos nomes dos arquivos kubectl create secret generic my-secret --from-file=ssh-privatekey=~/.ssh/id_rsa --from-file=ssh-publickey=~/.ssh/id_rsa.pub # Cria um novo segredo chamado my-secret com key1=supersecret e key2=topsecret kubectl create secret generic my-secret --from-literal=key1=supersecret --from-literal=key2=topsecret

source: # Create a new service account named my-service-account kubectl create serviceaccount my-service-account
pt_br: # Cria um novo service account chamado my-service-account kubectl create serviceaccount my-service-account

source: # Create a new ExternalName service named my-ns kubectl create service externalname my-ns --external-name bar.com
pt_br: # Cria um novo serviço do tipo ExternalName chamado my-ns kubectl create service externalname my-ns —external-name bar.com

source: Create an ExternalName service with the specified name. ExternalName service references to an external DNS address instead of only pods, which will allow application authors to reference services that exist off platform, on other clusters, or locally.
pt_br: Cria um serviço do tipo ExternalName com o nome especificado. Serviço ExternalName referencia um endereço externo de DNS ao invés de apenas pods, o que permite aos desenvolvedores de aplicações referenciar serviços que existem fora da plataforma, em outros clusters ou localmente.

source: Help provides help for any command in the application. Simply type kubectl help [path to command] for full details.
pt_br: Help provê ajuda para qualquer comando na aplicação. Digite simplesmente kubectl help [caminho do comando] para detalhes completos.

source: # Create a new LoadBalancer service named my-lbs kubectl create service loadbalancer my-lbs --tcp=5678:8080
pt_br: # Cria um novo serviço do tipo LoadBalancer chamado my-lbs kubectl create service loadbalancer my-lbs —tcp=5678:8080

source: # Create a new clusterIP service named my-cs kubectl create service clusterip my-cs --tcp=5678:8080 # Create a new clusterIP service named my-cs (in headless mode) kubectl create service clusterip my-cs --clusterip="None"
pt_br: # Cria um novo serviço clusterIP chamado my-cs kubectl create service clusterip my-cs --tcp=5678:8080 # Cria um novo serviço clusterIP chamado my-cs (em modo headless) kubectl create service clusterip my-cs --clusterip="None"

source: # Create a new deployment named my-dep that runs the busybox image. kubectl create deployment my-dep --image=busybox
pt_br: # Cria um novo deployment chamado my-dep que executa uma imagem busybox. kubectl create deployment my-dep —image=busybox

source: # Create a new nodeport service named my-ns kubectl create service nodeport my-ns --tcp=5678:8080
pt_br: # Cria um novo serviço nodeport chamado my-ns kubectl create service nodeport my-ns —tcp=5678:8080

source: # Dump current cluster state to stdout kubectl cluster-info dump # Dump current cluster state to /path/to/cluster-state kubectl cluster-info dump --output-directory=/path/to/cluster-state # Dump all namespaces to stdout kubectl cluster-info dump --all-namespaces # Dump a set of namespaces to /path/to/cluster-state kubectl cluster-info dump --namespaces default,kube-system --output-directory=/path/to/cluster-state
pt_br: # Coleta o estado corrente do cluster e exibe no stdout kubectl cluster-info dump # Coleta o estado corrente do custer para /path/to/cluster-state kubectl cluster-info dump --output-directory=/path/to/cluster-state # Coleta informação de todos os namespaces para stdout kubectl cluster-info dump --all-namespaces # Coleta o conjunto especificado de namespaces para /path/to/cluster-state kubectl cluster-info dump --namespaces default,kube-system --output-directory=/path/to/cluster-state

source: # Update pod 'foo' with the annotation 'description' and the value 'my frontend'. # If the same annotation is set multiple times, only the last value will be applied kubectl annotate pods foo description='my frontend' # Update a pod identified by type and name in "pod.json" kubectl annotate -f pod.json description='my frontend' # Update pod 'foo' with the annotation 'description' and the value 'my frontend running nginx', overwriting any existing value. kubectl annotate --overwrite pods foo description='my frontend running nginx' # Update all pods in the namespace kubectl annotate pods --all description='my frontend running nginx' # Update pod 'foo' only if the resource is unchanged from version 1. kubectl annotate pods foo description='my frontend running nginx' --resource-version=1 # Update pod 'foo' by removing an annotation named 'description' if it exists. # Does not require the --overwrite flag. kubectl annotate pods foo description-
pt_br: # Atualiza o pod 'foo' com a annotation 'description' e o valor 'my frontend'. # Se a mesma annotation é configurada várias vezes, apenas o último valor será utilizado kubectl annotate pods foo description='my frontend' # Atualiza o pod identificado pelo tipo e nome definido no "pod.json" kubectl annotate -f pod.json description='my frontend' # Atualiza o pod 'foo' com a annotation 'description' e o valor 'my frontend running nginx', sobreescrevendo qualquer valor existente. kubectl annotate --overwrite pods foo description='my frontend running nginx' # Atualiza todos os pods no namespace kubectl annotate pods --all description='my frontend running nginx' # Atualiza o pod 'foo' apenas se o recurso não foi modificado na versão 1. kubectl annotate pods foo description='my frontend running nginx' --resource-version=1 # Atualiza o pod 'foo' removendo a annotation chamada 'description' se ela existir. # Não necessita da flag --overwrite. kubectl annotate pods foo description-

source: Create a LoadBalancer service with the specified name.
pt_br: Cria um serviço do tipo LoadBalancer com o nome especificado.

source: Create a clusterIP service with the specified name.
pt_br: Cria um serviço do tipo clusterIP com o nome especificado.

source: Create a deployment with the specified name.
pt_br: Cria um deployment com o nome especificado.

source: Create a nodeport service with the specified name.
pt_br: Cria um serviço do tipo nodeport com o nome especificado.

source: Dumps cluster info out suitable for debugging and diagnosing cluster problems. By default, dumps everything to stdout. You can optionally specify a directory with --output-directory. If you specify a directory, kubernetes will build a set of files in that directory. By default only dumps things in the 'kube-system' namespace, but you can switch to a different namespace with the --namespaces flag, or specify --all-namespaces to dump all namespaces. The command also dumps the logs of all of the pods in the cluster, these logs are dumped into different directories based on namespace and pod name.
pt_br: Coleta informações do cluster para debugar e diagnosticar problemas do dele. Por padrão, exibe tudo para o stdout. Você pode, se quiser, especificar um diretório com --output-directory. Se especificar o diretório, kubernetes irá montar um conjunto de arquivos no diretório. Por padrão, apenas coleta informações no namespace 'kube-system' , mas você pode trocar para um namespace diferente com a flag --namespaces, ou especificar --all-namespaces para todos os namespaces. O comando também coleta os logs de todos os pods no cluster, estes logs são salvos em outros diretórios baseado no namespace e nome do pod.

source: Display addresses of the master and services with label kubernetes.io/cluster-service=true To further debug and diagnose cluster problems, use 'kubectl cluster-info dump'.
pt_br: Mostra os endereços dos servidores de gerenciamento e serviços com o label kubernetes.io/cluster-service=true Para debugar e diagnosticar outros problemas do cluster, utilize 'kubectl cluster-info dump'.

source: A comma-delimited set of quota scopes that must all match each object tracked by the quota.
pt_br: Lista de valores delimitados por vírgulas para um conjunto de escopos de quota que devem corresponder para cada objeto rastreado pela quota.

source: A comma-delimited set of resource=quantity pairs that define a hard limit.
pt_br: Lista de valores delimitados por vírgulas ajusta os pares resource=quantity que define um limite rigído.

source: A label selector to use for this budget. Only equality-based selector requirements are supported.
pt_br: Um seletor de label a ser usado para o PDB. Apenas seletores baseado em igualdade são suportados.

source: A label selector to use for this service. Only equality-based selector requirements are supported. If empty (the default) infer the selector from the replication controller or replica set.)
pt_br: Um seletor de label para ser utilizado neste serviço. Apenas seletores baseado em igualdade são suportados. Se vazio (por padrão) o seletor do replication controller ou replica set será utilizado.

source: A schedule in the Cron format the job should be run with.
pt_br: Agendamento no formato Cron em qual o job deve rodar.

source: Additional external IP address (not managed by Kubernetes) to accept for the service. If this IP is routed to a node, the service can be accessed by this IP in addition to its generated service IP.
pt_br: Um IP externo adicional (não gerenciado pelo Kubernetes) para ser usado no serviço. Se este IP for roteado para um nó, o serviço pode ser acessado por este IP além de seu IP de serviço gerado.

source: An inline JSON override for the generated object. If this is non-empty, it is used to override the generated object. Requires that the object supply a valid apiVersion field.
pt_br: Uma substituição inline JSON para o objeto gerado. Se não estiver vazio, ele será usado para substituir o objeto gerado. Requer que o objeto forneça um campo apiVersion válido.

source: An inline JSON override for the generated service object. If this is non-empty, it is used to override the generated object. Requires that the object supply a valid apiVersion field. Only used if --expose is true.
pt_br: Uma substituição inline JSON para o objeto de serviço gerado. Se não estiver vazio, ele será usado para substituir o objeto gerado. Requer que o objeto forneça o campo apiVersion válido. Usado apenas se --expose for true.

source: Apply a configuration to a resource by filename or stdin
pt_br: Aplica a configuração para um recurso utilizado um nome de arquivo ou stdin

source: Approve a certificate signing request
pt_br: Aprova uma solicitação de assinatura de certificado

source: Assign your own ClusterIP or set to 'None' for a 'headless' service (no loadbalancing).
pt_br: Atribuir o seu próprio ClusterIP ou configura para 'None' para um serviço 'headless' (sem loadbalancing).

source: Attach to a running container
pt_br: Se conecta a um container em execução

source: Auto-scale a Deployment, ReplicaSet, or ReplicationController
pt_br: Auto-escala um Deployment, ReplicaSet ou ReplicationController
