Repository: HSQ-Q/kube-MSRM
Catalog: translations/kubectl/*/LC_MESSAGES/k8s.po
Languages: pt_br

source: ClusterIP to be assigned to the service. Leave empty to auto-allocate, or set to 'None' to create a headless service.
pt_br: ClusterIP que será atribuído ao serviço. Deixe vazio para auto atribuição, ou configure para 'None' para criar um serviço headless.

source: ClusterRole this ClusterRoleBinding should reference
pt_br: ClusterRole que esse ClusterRoleBinding deve referenciar

source: ClusterRole this RoleBinding should reference
pt_br: ClusterRole que esse RoleBinding deve referenciar

source: Container name which will have its image upgraded. Only relevant when --image is specified, ignored otherwise. Required when using --image on a multi-container pod
pt_br: Nome do contêiner que terá sua imagem atualizada. Relevante apenas quando --image for especificado, caso contrário, ignorado. Obrigatório ao usar --image em um pod com vários contêineres

source: Convert config files between different API versions
pt_br: Converte arquivos de configuração entre versões de API diferentes

source: Copy files and directories to and from containers.
pt_br: Copia arquivos e diretórios de e para containers.

source: Create a ClusterRoleBinding for a particular ClusterRole
pt_br: Cria um ClusterRoleBinding para um ClusterRole especifico

source: Create a LoadBalancer service.
pt_br: Cria um serviço do tipo LoadBalancer.

source: Create a NodePort service.
pt_br: Cria um serviço do tipo NodePort.

source: Create a RoleBinding for a particular Role or ClusterRole
pt_br: Cria um RoleBinding para uma Role ou ClusterRole especifico

source: Create a TLS secret
pt_br: Cria uma secret do tipo TLS

source: Create a clusterIP service.
pt_br: Cria um serviço do tipo clusterIP.

source: Create a configmap from a local file, directory or literal value
pt_br: Cria um configmap com base em um arquivo, diretório, ou um valor literal

source: Create a deployment with the specified name.
pt_br: Cria um deployment com um nome especificado.

source: Create a namespace with the specified name
pt_br: Cria a namespace com um nome especificado

source: Create a pod disruption budget with the specified name.
pt_br: Cria um pod disruption budget com um nome especificado.

source: Create a quota with the specified name.
pt_br: Cria uma quota com um nome especificado.

source: Create a resource by filename or stdin
pt_br: Cria um recurso por nome de arquivo ou stdin

source: Create a secret for use with a Docker registry
pt_br: Cria um secret para ser utilizado com o Docker registry

source: Create a secret from a local file, directory or literal value
pt_br: Cria um secret com base em um arquivo, diretório ou um valor literal

source: Create a secret using specified subcommand
pt_br: Cria um secret utilizando um sub-comando especificado

source: Create a service account with the specified name
pt_br: Cria uma conta de serviço com um nome especificado

source: Create a service using specified subcommand.
pt_br: Cria um service utilizando um sub-comando especificado.

source: Create an ExternalName service.
pt_br: Cria um serviço do tipo ExternalName.

source: Delete resources by filenames, stdin, resources and names, or by resources and label selector
pt_br: Apaga os recusros por nome de arquivos, stdin, recursos e nomes, ou por recursos e seletor de label

source: Delete the specified cluster from the kubeconfig
pt_br: Apaga o cluster especificado do kubeconfig

source: Delete the specified context from the kubeconfig
pt_br: Apaga o contexto especificado do kubeconfig

source: Deny a certificate signing request
pt_br: Rejeita o pedido de assinatura do certificado

source: Deprecated: Gracefully shut down a resource by name or filename
pt_br: Descontinuado: Termina um recurso por nome ou nome de arquivo

source: Describe one or many contexts
pt_br: Mostra um ou mais contextos

source: Display Resource (CPU/Memory) usage of nodes
pt_br: Mostra a utilização de recursos (CPU/Memória) nos nodes

source: Display Resource (CPU/Memory) usage of pods
pt_br: Mostra a utilização de recursos (CPU/Memória) nos pods

source: Display Resource (CPU/Memory) usage.
pt_br: Mostra a utilização de recursos (CPU/Memória).

source: Display cluster info
pt_br: Mostra as informações do cluster

source: Display clusters defined in the kubeconfig
pt_br: Mostra os clusters definidos no kubeconfig

source: Display merged kubeconfig settings or a specified kubeconfig file
pt_br: Mostra a configuração do kubeconfig mescladas ou um arquivo kubeconfig especificado

source: Display one or many resources
pt_br: Mostra um ou mais recursos

source: Displays the current-context
pt_br: Mostra o contexto corrente

source: Documentation of resources
pt_br: Documentação dos recursos

source: Drain node in preparation for maintenance
pt_br: Drenar o node para preparação de manutenção

source: Dump lots of relevant info for debugging and diagnosis
pt_br: Realiza o dump de muitas informações relevantes para debugging e diagnósticos

source: Edit a resource on the server
pt_br: Edita um recurso no servidor

source: Email for Docker registry
pt_br: Email para o Docker registry

source: Execute a command in a container
pt_br: Executa um comando em um container

source: Explicit policy for when to pull container images. Required when --image is same as existing image, ignored otherwise.
pt_br: Política explícita para quando extrair imagens de contêiner. Obrigatório quando --image for igual à imagem existente, caso contrário, será ignorado.

source: Forward one or more local ports to a pod
pt_br: Encaminhar uma ou mais portas locais para um pod

source: Help about any command
pt_br: Ajuda sobre qualquer comando

source: IP to assign to the Load Balancer. If empty, an ephemeral IP will be created and used (cloud-provider specific).
pt_br: IP para ser alocado no Load Balancer. Se vazio, um IP efêmero será criado e utilizado (específico para cada provedor cloud).

source: If non-empty, set the session affinity for the service to this; legal values: 'None', 'ClientIP'
pt_br: Se não vazio, configura a afinidade de sessão para o serviço; valores válidos: 'None', 'ClientIP'

source: If non-empty, the annotation update will only succeed if this is the current resource-version for the object. Only valid when specifying a single resource.
pt_br: Se não estiver vazio, a atualização dos annotation só terá êxito se esta for a versão do recurso atual para o objeto. Válido apenas ao especificar um único recurso.

source: If non-empty, the labels update will only succeed if this is the current resource-version for the object. Only valid when specifying a single resource.
pt_br: Se não estiver vazio, a atualização dos labels só terá êxito se esta for a versão do recurso atual para o objeto. Válido apenas ao especificar um único recurso.

source: Image to use for upgrading the replication controller. Must be distinct from the existing image (either new image or new image tag). Can not be used with --filename/-f
pt_br: Imagem a ser utilizada para atualizar o replication controller. Deve ser diferente da imagem atual (pode ser uma nova imagem ou uma nova tag). Não pode ser utilizada com —filename/-f

source: Manage a deployment rollout
pt_br: Gerencia um deployment rollout

source: Mark node as schedulable
pt_br: Marca o node como agendável

source: Mark node as unschedulable
pt_br: Marca o node como não agendável

source: Mark the provided resource as paused
pt_br: Marca o recurso fornecido como pausado

source: Modify certificate resources.
pt_br: Edita o certificado dos recursos.

source: Modify kubeconfig files
pt_br: Edita o arquivo kubeconfig

source: Name or number for the port on the container that the service should direct traffic to. Optional.
pt_br: Nome ou o número da porta em um container em que o serviço deve direcionar o tráfego. Opcional.

source: Only return logs after a specific date (RFC3339). Defaults to all logs. Only one of since-time / since may be used.
pt_br: Apenas retorna os logs após uma data específica (RFC3339). Padrão para todos os logs. Apenas um since-time / since deve ser utilizado.

source: Output shell completion code for the specified shell (bash or zsh)
pt_br: Saída do autocomplete de shell para um Shell específico (bash ou zsh)

source: Output the formatted object with the given group version (for ex: 'extensions/v1beta1').)
pt_br: Imprime o objeto formatado com a dada versão de grupo (por exemplo: 'extensions/v1beta1').)

source: Password for Docker registry authentication
pt_br: Senha para a autenticação do registro do Docker

source: Path to PEM encoded public key certificate.
pt_br: Caminho para a chave pública em formato PEM.

source: Path to private key associated with given certificate.
pt_br: Caminho para a chave private associada a um certificado fornecido.

source: Perform a rolling update of the given ReplicationController
pt_br: Executa uma atualização contínua

source: Precondition for resource version. Requires that the current resource version match this value in order to scale.
pt_br: Pré-condição para a versão do recurso. Requer que a versão do recurso atual corresponda a este valor para escalar.

source: Print the client and server version information
pt_br: Mostra a informação de versão do cliente e do servidor

source: Print the list of flags inherited by all commands
pt_br: Mostra a lista de opções herdadas por todos os comandos

source: Print the logs for a container in a pod
pt_br: Mostra os logs de um container em um pod

source: Replace a resource by filename or stdin
pt_br: Substitui um recurso por um nome de arquivo ou stdin

source: Resume a paused resource
pt_br: Retoma um recurso pausado

source: Role this RoleBinding should reference
pt_br: Role que a RoleBinding deve referenciar

source: Run a particular image on the cluster
pt_br: Executa uma imagem específica no cluster

source: Run a proxy to the Kubernetes API server
pt_br: Executa um proxy para o servidor de API do Kubernetes

source: Server location for Docker registry
pt_br: Localização do servidor para o registro do Docker

source: Set a new size for a Deployment, ReplicaSet, Replication Controller, or Job
pt_br: Define um novo tamanho para um Deployment, ReplicaSet, Replication Controller, ou Job

source: Set specific features on objects
pt_br: Define funcionalidades específicas em objetos

source: Set the last-applied-configuration annotation on a live object to match the contents of a file.
pt_br: Define a anotação last-applied-configuration em um objeto existente para corresponder ao conteúdo do arquivo.

source: Set the selector on a resource
pt_br: Define um seletor em um recurso

source: Sets a cluster entry in kubeconfig
pt_br: Define um cluster no arquivo kubeconfig

source: Sets a context entry in kubeconfig
pt_br: Define um contexto no arquivo kubeconfig

source: Sets a user entry in kubeconfig
pt_br: Define um usuário no arquivo kubeconfig

source: Sets an individual value in a kubeconfig file
pt_br: Define um valor individual no arquivo kubeconfig

source: Sets the current-context in a kubeconfig file
pt_br: Define o current-context no arquivo kubeconfig

source: Show details of a specific resource or group of resources
pt_br: Mostra os detalhes de um recurso específico ou de um grupo de recursos

source: Show the status of the rollout
pt_br: Mostra o status de uma atualização dinamica

source: Synonym for --target-port
pt_br: Sinônimo para —target-port

source: Take a replication controller, service, deployment or pod and expose it as a new Kubernetes Service
pt_br: Pega um replication controlar, service, deployment ou pod e expõe como um novo Serviço do Kubernetes

source: The image for the container to run.
pt_br: A imagem para o container executar.

source: The image pull policy for the container. If left empty, this value will not be specified by the client and defaulted by the server
pt_br: A política de obtenção de imagens. Se deixado em branco, este valor não será especificado pelo cliente e será utilizado o padrão do servidor

source: The key to use to differentiate between two different controllers, default 'deployment'. Only relevant when --image is specified, ignored otherwise
pt_br: A chave utilizada para diferenciar entre dois controlares diferentes, padrão 'deployment'. Apenas relevante quando --image é especificado, é ignorado caso contrário

source: The minimum number or percentage of available pods this budget requires.
pt_br: Um número mínimo ou porcentagem de pods disponíveis que este budget requer.

source: The name for the newly created object.
pt_br: O nome para o objeto recém criado.

source: The name for the newly created object. If not specified, the name of the input resource will be used.
pt_br: O nome para o objeto recém criado. Se não especificado, o nome do input resource será utilizado.

source: The name of the API generator to use, see http://kubernetes.io/docs/user-guide/kubectl-conventions/#generators for a list.
pt_br: O nome do gerador de API a ser usado, veja a lista em http://kubernetes.io/docs/user-guide/kubectl-conventions/#generators.

source: The name of the API generator to use. Currently there is only 1 generator.
pt_br: O nome do gerador de API a ser usado. Atualmente existe apenas 1 gerador.

source: The name of the API generator to use. There are 2 generators: 'service/v1' and 'service/v2'. The only difference between them is that service port in v1 is named 'default', while it is left unnamed in v2. Default is 'service/v2'.
pt_br: O nome do gerador de API a ser usado. Existem 2 geradores: 'service/v1' e 'service/v2'. A única diferença entre eles é que a porta de serviço na v1 é chamada de 'default', enquanto ela é deixada sem nome na v2. O padrão é 'service/v2'.

source: The name of the generator to use for creating a service. Only used if --expose is true
pt_br: O nome do recurso para ser utilizado quando criando um serviço. Apenas utilizado se —expose é verdadeiro

source: The network protocol for the service to be created. Default is 'TCP'.
pt_br: O protocolo de rede para o serviço ser criado. Padrão é 'TCP'.

source: The port that the service should serve on. Copied from the resource being exposed, if unspecified
pt_br: A porta para que o serviço possa servir. Copiado do recurso sendo exposto, se não especificado

source: The port that this container exposes. If --expose is true, this is also the port used by the service that is created.
pt_br: A porta que o container expõe. Se —expose é verdadeiro, esta também é a porta utilizada pelo serviço quando for criado.

source: The resource requirement limits for this container. For example, 'cpu=200m,memory=512Mi'. Note that server side components may assign limits depending on the server configuration, such as limit ranges.
pt_br: O recurso requerido para este container. Por exemplo, 'cpu=200m,memory=512Mi'. Observe que os componentes do lado do servidor podem atribuir limites, dependendo da configuração do servidor, como intervalos de limite.

source: The resource requirement requests for this container. For example, 'cpu=100m,memory=256Mi'. Note that server side components may assign requests depending on the server configuration, such as limit ranges.
pt_br: O recurso requerido de requests para este container. Por exemplo, 'cpu=100m,memory=256Mi'. Observe que os componentes do lado do servidor podem atribuir requests, dependendo da configuração do servidor, como intervalos de limite.

source: The restart policy for this Pod. Legal values [Always, OnFailure, Never]. If set to 'Always' a deployment is created, if set to 'OnFailure' a job is created, if set to 'Never', a regular pod is created. For the latter two --replicas must be 1. Default 'Always', for CronJobs `Never`.
pt_br: A politica de restart para este Pod. Possíveis valores [Always, OnFailure, Never]. Se configurado para 'Always' um deployment é criado, se configurado para 'OnFailure' um job é criado, se configurado para 'Never', um pod é criado. Para os dois últimos —replicas deve ser 1. Valor padrão 'Always', para CronJobs `Never`.

source: The type of secret to create
pt_br: O tipo de segredo para criar

source: Type for this service: ClusterIP, NodePort, or LoadBalancer. Default is 'ClusterIP'.
pt_br: Tipo para este serviço: ClusterIP, NodePort, ou LoadBalancer. Valor padrão é 'ClusterIP'.

source: Undo a previous rollout
pt_br: Desfazer o rollout anterior

source: Unsets an individual value in a kubeconfig file
pt_br: Remover um valor individual do arquivo kubeconfig

source: Update field(s) of a resource using strategic merge patch
pt_br: Atualizar o(s) campo(s) de um recurso usando a estratégia de merge patch

source: Update image of a pod template
pt_br: Atualizar a imagem de um template de pod

source: Update resource requests/limits on objects with pod templates
pt_br: Atualizar os recursos de request/limites em um objeto com template de pod

source: Update the annotations on a resource
pt_br: Atualizar as anotações de um recurso

source: Update the labels on a resource
pt_br: Atualizar os labels de um recurso

source: Update the taints on one or more nodes
pt_br: Atualizar o taints de um ou mais nodes

source: Username for Docker registry authentication
pt_br: Nome de usuário para a autenticação no Docker registry

source: View latest last-applied-configuration annotations of a resource/object
pt_br: Visualizar a última anotação last-applied-configuration de um recurso/objeto

source: View rollout history
pt_br: Visualizar o histórico de rollout

source: Where to output the files. If empty or '-' uses stdout, otherwise creates a directory hierarchy in that directory
pt_br: Onde colocar os arquivos de saída. Se vazio ou '-' usa o stdout do terminal, caso contrário, cria uma hierarquia no diretório configurado

source: external name of service
pt_br: nome externo do serviço

source: kubectl controls the Kubernetes cluster manager
pt_br: kubectl controla o gerenciador de cluster do Kubernetes
