Repository: HSQ-Q/kube-MSRM
Catalog: translations/kubectl/*/LC_MESSAGES/k8s.po
Languages: pt_br

source: # Create a ClusterRoleBinding for user1, user2, and group1 using the cluster-admin ClusterRole kubectl create clusterrolebinding cluster-admin --clusterrole=cluster-admin --user=user1 --user=user2 --group=group1
pt_br: # Criar o ClusterRoleBinding para user1, user2, e group1 utilizando o ClusterRole cluster-admin kubectl create clusterrolebinding cluster-admin --clusterrole=cluster-admin —user=user1 —user=user2 —group=group1

source: # Create a RoleBinding for user1, user2, and group1 using the admin ClusterRole kubectl create rolebinding admin --clusterrole=admin --user=user1 --user=user2 --group=group1
pt_br: # Criar uma RoleBinding para user1, user2, e group1 utilizando o admin ClusterRole kubectl create rolebinding admin --clusterrole=admin —user=user1 —user=user2 —group=group1

source: # Create a new configmap named my-config based on folder bar kubectl create configmap my-config --from-file=path/to/bar # Create a new configmap named my-config with specified keys instead of file basenames on disk kubectl create configmap my-config --from-file=key1=/path/to/bar/file1.txt --from-file=key2=/path/to/bar/file2.txt # Create a new configmap named my-config with key1=config1 and key2=config2 kubectl create configmap my-config --from-literal=key1=config1 --from-literal=key2=config2
pt_br: # Criar um novo configmap com o nome de my-config baseado na pasta bar kubectl create configmap my-config —from-file=path/to/bar # Cria um novo configmap com o nome my-config, onde cada chave possui o valor especificado em um arquivo distinto no disco kubectl create configmap my-config —from-file=key1=/path/to/bar/file1.txt —from-file=key2=/path/to/bar/file2.txt # Criar um novo configmap com o nome de my-config com key1=config1 e key2=config2 kubectl create configmap my-config —from-literal=key1=config1 —from-literal=key2=config2

source: # If you don't already have a .dockercfg file, you can create a dockercfg secret directly by using: kubectl create secret docker-registry my-secret --docker-server=DOCKER_REGISTRY_SERVER --docker-username=DOCKER_USER --docker-password=DOCKER_PASSWORD --docker-email=DOCKER_EMAIL
pt_br: # Se você ainda não tem o arquivo .dockercfg, você pode gerar diretamente o dockercfg secret utilizando o comando: kubectl create secret docker-registry my-secret —docker-server=DOCKER_REGISTRY_SERVER —docker-username=DOCKER_USER —docker-password=DOCKER_PASSWORD —docker-email=DOCKER_EMAIL

source: # Show metrics for all nodes kubectl top node # Show metrics for a given node kubectl top node NODE_NAME
pt_br: # Mostra as métricas para todos os nodes kubectl top node # Mostra as métricas para um node específico kubectl top node NODE_NAME

source: # Apply the configuration in pod.json to a pod. kubectl apply -f ./pod.json # Apply the JSON passed into stdin to a pod. cat pod.json | kubectl apply -f - # Note: --prune is still in Alpha # Apply the configuration in manifest.yaml that matches label app=nginx and delete all the other resources that are not in the file and match label app=nginx. kubectl apply --prune -f manifest.yaml -l app=nginx # Apply the configuration in manifest.yaml and delete all the other configmaps that are not in the file. kubectl apply --prune -f manifest.yaml --all --prune-whitelist=core/v1/ConfigMap
pt_br: # Aplica a configuração do arquivo pod.json a um pod. kubectl apply -f ./pod.json # Aplica o JSON recebido via stdin para um pod. cat pod.json | kubectl apply -f - # Nota: —prune ainda está em Alpha # Aplica a configuração do manifest.yaml que conter o label app=nginx e remove todos os outros recursos que não estejam no arquivo e não contenham o label. kubectl apply —prune -f manifest.yaml -l app=nginx # Aplica a configuração do manifest.yaml e remove todos os outros configmaps que não estão no arquivo. kubectl apply —prune -f manifest.yaml —all —prune-whitelist=core/v1/ConfigMap

source: # Auto scale a deployment "foo", with the number of pods between 2 and 10, no target CPU utilization specified so a default autoscaling policy will be used: kubectl autoscale deployment foo --min=2 --max=10 # Auto scale a replication controller "foo", with the number of pods between 1 and 5, target CPU utilization at 80%: kubectl autoscale rc foo --max=5 --cpu-percent=80
pt_br: # Escala automaticamente um deployment "foo", com o número de pods entre 2 e 10, sem especificar a utilização da CPU o padrão da política de autoscaling será utilizado: kubectl autoscale deployment foo —min=2 —max=10 # Escala automaticamente um replication controller "foo", com o número de pods entre 1 and 5, e definindo a utilização da CPU em 80%: kubectl autoscale rc foo —max=5 —cpu-percent=80

source: # Convert 'pod.yaml' to latest version and print to stdout. kubectl convert -f pod.yaml # Convert the live state of the resource specified by 'pod.yaml' to the latest version # and print to stdout in json format. kubectl convert -f pod.yaml --local -o json # Convert all files under current directory to latest version and create them all. kubectl convert -f . | kubectl create -f -
pt_br: # converte o arquivo 'pod.yaml' para a versão mais atual e imprime a saída para o stdout. kubectl convert -f pod.yaml # Converte o estado atual do recurso especificado pelo 'pod.yaml' para a versão mais atual # e imprime a saída para o stdout no formato json. kubectl convert -f pod.yaml —local -o json # Converte todos os arquivos dentro do diretório atual para a versão mais recente e cria todos. kubectl convert -f . | kubectl create -f -

source: # Create a ClusterRole named "pod-reader" that allows user to perform "get", "watch" and "list" on pods kubectl create clusterrole pod-reader --verb=get,list,watch --resource=pods # Create a ClusterRole named "pod-reader" with ResourceName specified kubectl create clusterrole pod-reader --verb=get,list,watch --resource=pods --resource-name=readablepod
pt_br: # Cria um ClusterRole com o nome de "pod-reader" que permite o usuário realizar "get", "watch" e "list" em pods kubectl create clusterrole pod-reader —verb=get,list,watch —resource=pods # Cria a ClusterRole com o nome de "pod-reader" com um ResourceName especificado kubectl create clusterrole pod-reader —verb=get,list,watch —resource=pods —resource-name=readablepod

source: # Create a Role named "pod-reader" that allows user to perform "get", "watch" and "list" on pods kubectl create role pod-reader --verb=get --verb=list --verb=watch --resource=pods # Create a Role named "pod-reader" with ResourceName specified kubectl create role pod-reader --verb=get --verg=list --verb=watch --resource=pods --resource-name=readablepod
pt_br: # Cria uma Role com o nome de "pod-reader" que permite o usuário realizar "get", "watch" e "list" em pods kubectl create role pod-reader —verb=get —verb=list —verb=watch —resource=pods # Cria uma Role com o nome de "pod-reader" com um ResourceName especificado kubectl create role pod-reader —verb=get —verg=list —verb=watch —resource=pods —resource-name=readablepod

source: # Create a new resourcequota named my-quota kubectl create quota my-quota --hard=cpu=1,memory=1G,pods=2,services=3,replicationcontrollers=2,resourcequotas=1,secrets=5,persistentvolumeclaims=10 # Create a new resourcequota named best-effort kubectl create quota best-effort --hard=pods=100 --scopes=BestEffort
pt_br: # Cria um novo resourcequota com o nome de my-quota kubectl create quota my-quota —hard=cpu=1,memory=1G,pods=2,services=3,replicationcontrollers=2,resourcequotas=1,secrets=5,persistentvolumeclaims=10 # Cria um novo resourcequota com o nome de best-effort kubectl create quota best-effort —hard=pods=100 —scopes=BestEffort

source: # Create a pod disruption budget named my-pdb that will select all pods with the app=rails label # and require at least one of them being available at any point in time. kubectl create poddisruptionbudget my-pdb --selector=app=rails --min-available=1 # Create a pod disruption budget named my-pdb that will select all pods with the app=nginx label # and require at least half of the pods selected to be available at any point in time. kubectl create pdb my-pdb --selector=app=nginx --min-available=50%
pt_br: # Cria um pod disruption budget com o nome de my-pdb que irá selecionar todos os pods com o label app=rails # e requer que pelo menos um deles esteja disponível a qualquer momento. kubectl create poddisruptionbudget my-pdb —selector=app=rails —min-available=1 # Cria um pod disruption budget com o nome de my-pdb que irá selecionar todos os pods com o label app=nginx # e requer pelo menos que metade dos pods selecionados estejam disponíveis em qualquer momento. kubectl create pdb my-pdb —selector=app=nginx —min-available=50%

source: # Create a pod using the data in pod.json. kubectl create -f ./pod.json # Create a pod based on the JSON passed into stdin. cat pod.json | kubectl create -f - # Edit the data in docker-registry.yaml in JSON using the v1 API format then create the resource using the edited data. kubectl create -f docker-registry.yaml --edit --output-version=v1 -o json
pt_br: # Cria um pod utilizando o arquivo pod.json. kubectl create -f ./pod.json # Cria um pod utilizando o JSON recebido via stdin. cat pod.json | kubectl create -f - # Edita o conteúdo do arquivo docker-registry.yaml em JSON utilizando o formato da API v1, criando o recurso com o conteúdo editado. kubectl create -f docker-registry.yaml —edit —output-version=v1 -o json

source: # Create a service for a replicated nginx, which serves on port 80 and connects to the containers on port 8000. kubectl expose rc nginx --port=80 --target-port=8000 # Create a service for a replication controller identified by type and name specified in "nginx-controller.yaml", which serves on port 80 and connects to the containers on port 8000. kubectl expose -f nginx-controller.yaml --port=80 --target-port=8000 # Create a service for a pod valid-pod, which serves on port 444 with the name "frontend" kubectl expose pod valid-pod --port=444 --name=frontend # Create a second service based on the above service, exposing the container port 8443 as port 443 with the name "nginx-https" kubectl expose service nginx --port=443 --target-port=8443 --name=nginx-https # Create a service for a replicated streaming application on port 4100 balancing UDP traffic and named 'video-stream'. kubectl expose rc streamer --port=4100 --protocol=udp --name=video-stream # Create a service for a replicated nginx using replica set, which serves on port 80 and connects to the containers on port 8000. kubectl expose rs nginx --port=80 --target-port=8000 # Create a service for an nginx deployment, which serves on port 80 and connects to the containers on port 8000. kubectl expose deployment nginx --port=80 --target-port=8000
pt_br: # Cria um serviço para um nginx replicado, que escuta na porta 80 e conecta na porta 8000 dos containers. \t kubectl expose rc nginx —port=80 —target-port=8000 # Cria um serviço para um replication controller identificado por tipo e com o nome especificado em "nginx-controller.yaml", que escuta na porta 80 e conecta na porta 8000 dos containers. kubectl expose -f nginx-controller.yaml —port=80 —target-port=8000 # Cria um serviço para um pod valid-pod, que escuta na porta 444 com o nome "frontend" kubectl expose pod valid-pod —port=444 —name=frontend # Cria um segundo serviço baseado no serviço acima, expondo a porta 8443 do container como porta 443 e com nome "nginx-https" kubectl expose service nginx —port=443 —target-port=8443 —name=nginx-https # Cria um serviço para uma aplicação streaming replicada na porta 4100 com trafico balanceado UDP e nome 'video-stream'. kubectl expose rc streamer —port=4100 —protocol=udp —name=video-stream # Cria um serviço para um nginx replicado usando o replica set, que escuta na porta 80 e conecta na porta 8000 dos containers. kubectl expose rs nginx —port=80 —target-port=8000 # Cria um serviço para um deployment nginx, que escuta na porta 80 e conecta na porta 8000 dos containers. kubectl expose deployment nginx —port=80 —target-port=8000

source: # Delete a pod using the type and name specified in pod.json. kubectl delete -f ./pod.json # Delete a pod based on the type and name in the JSON passed into stdin. cat pod.json | kubectl delete -f - # Delete pods and services with same names "baz" and "foo" kubectl delete pod,service baz foo # Delete pods and services with label name=myLabel. kubectl delete pods,services -l name=myLabel # Delete a pod with minimal delay kubectl delete pod foo --now # Force delete a pod on a dead node kubectl delete pod foo --grace-period=0 --force # Delete all pods kubectl delete pods --all
pt_br: # Remove um pod usando o tipo e nome especificado no arquivo pod.json. kubectl delete -f ./pod.json # Remove um pod baseado no tipo e nome no JSON passado na entrada de comando(stdin). cat pod.json | kubectl delete -f - # Remove pods e serviços com os nomes "baz" e "foo" kubectl delete pod,service baz foo # Remove pods e serviços com label name=myLabel. kubectl delete pods,services -l name=myLabel # Remove um pod com um mínimo de delay kubectl delete pod foo —now # Força a remoção de um pod em um node morto kubectl delete pod foo —grace-period=0 —force # Remove todos os pods kubectl delete pods —all

source: # Describe a node kubectl describe nodes kubernetes-node-emt8.c.myproject.internal # Describe a pod kubectl describe pods/nginx # Describe a pod identified by type and name in "pod.json" kubectl describe -f pod.json # Describe all pods kubectl describe pods # Describe pods by label name=myLabel kubectl describe po -l name=myLabel # Describe all pods managed by the 'frontend' replication controller (rc-created pods # get the name of the rc as a prefix in the pod the name). kubectl describe pods frontend
pt_br: # Descreve um node kubectl describe nodes kubernetes-node-emt8.c.myproject.internal # Descreve um pod kubectl describe pods/nginx # Descreve um pod identificado pelo tipo e nome no arquivo "pod.json" kubectl describe -f pod.json # Descreve todos os pods kubectl describe pods # Descreve os pods com label name=myLabel kubectl describe po -l name=myLabel # Descreve todos os pods gerenciados pelo replication controller 'frontend' (rc-created pods # tem o nome de rc como prefixo no nome do pod). kubectl describe pods frontend

source: # Drain node "foo", even if there are pods not managed by a ReplicationController, ReplicaSet, Job, DaemonSet or StatefulSet on it. $ kubectl drain foo --force # As above, but abort if there are pods not managed by a ReplicationController, ReplicaSet, Job, DaemonSet or StatefulSet, and use a grace period of 15 minutes. $ kubectl drain foo --grace-period=900
pt_br: # Drena o node "foo", mesmo se os pods não são gerenciados por um ReplicationController, ReplicaSet, Job, DaemonSet ou StatefulSet. $ kubectl drain foo —force # Mesmo que acima, mas é interrompido se os pods não são gerenciados por um ReplicationController, ReplicaSet, Job, DaemonSet ou StatefulSet, e tem espera por 15 minutos. $ kubectl drain foo —grace-period=900

source: # Edit the service named 'docker-registry': kubectl edit svc/docker-registry # Use an alternative editor KUBE_EDITOR="nano" kubectl edit svc/docker-registry # Edit the job 'myjob' in JSON using the v1 API format: kubectl edit job.v1.batch/myjob -o json # Edit the deployment 'mydeployment' in YAML and save the modified config in its annotation: kubectl edit deployment/mydeployment -o yaml --save-config
pt_br: # Edita o serviço chamado 'docker-registry': kubectl edit svc/docker-registry # Usa um editor alternativo KUBE_EDITOR="nano" kubectl edit svc/docker-registry # Edita o Job 'myjob' em JSON utilizando o format da API v1: kubectl edit job.v1.batch/myjob -o json # Edita o deployment 'mydeployment' em YAML e salva a configuração modificada em sua annotation: kubectl edit deployment/mydeployment -o yaml —save-config

source: # Get output from running 'date' from pod 123456-7890, using the first container by default kubectl exec 123456-7890 date # Get output from running 'date' in ruby-container from pod 123456-7890 kubectl exec 123456-7890 -c ruby-container date # Switch to raw terminal mode, sends stdin to 'bash' in ruby-container from pod 123456-7890 # and sends stdout/stderr from 'bash' back to the client kubectl exec 123456-7890 -c ruby-container -i -t -- bash -il
pt_br: # Pega a saída de execução do comando 'date' do pod 123456-7890, usando o primeiro container por padrão kubectl exec 123456-7890 date # Pega a saída de execução do comando 'date' no ruby-container do pod 123456-7890 kubectl exec 123456-7890 -c ruby-container date # Troca para raw terminal mode, envia stdin para o 'bash' no ruby-container do pod 123456-7890 # e envia stdout/stderr do 'bash' de volta para o cliente kubectl exec 123456-7890 -c ruby-container -i -t — bash -il

source: # Get output from running pod 123456-7890, using the first container by default kubectl attach 123456-7890 # Get output from ruby-container from pod 123456-7890 kubectl attach 123456-7890 -c ruby-container # Switch to raw terminal mode, sends stdin to 'bash' in ruby-container from pod 123456-7890 # and sends stdout/stderr from 'bash' back to the client kubectl attach 123456-7890 -c ruby-container -i -t # Get output from the first pod of a ReplicaSet named nginx kubectl attach rs/nginx
pt_br: # Pega a saída do pod em execução 123456-7890, utilizando o primeiro container por padrão kubectl attach 123456-7890 # Pega a saída do ruby-container do pod 123456-7890 kubectl attach 123456-7890 -c ruby-container # Troca para raw terminal mode, envia stdin para o 'bash' no ruby-container do pod 123456-7890 # e envia stdout/stderr do 'bash' de volta para o cliente kubectl attach 123456-7890 -c ruby-container -i -t # Pega a saída do primeiro pod de um ReplicaSet chamado nginx kubectl attach rs/nginx

source: # Get the documentation of the resource and its fields kubectl explain pods # Get the documentation of a specific field of a resource kubectl explain pods.spec.containers
pt_br: # Mostra a documentação do recurso e seus campos kubectl explain pods # Mostra a documentação de um campo específico de um recurso kubectl explain pods.spec.containers

source: # Install bash completion on a Mac using homebrew brew install bash-completion printf " # Bash completion support source $(brew --prefix)/etc/bash_completion " >> $HOME/.bash_profile source $HOME/.bash_profile # Load the kubectl completion code for bash into the current shell source <(kubectl completion bash) # Write bash completion code to a file and source if from .bash_profile kubectl completion bash > ~/.kube/completion.bash.inc printf " # Kubectl shell completion source '$HOME/.kube/completion.bash.inc' " >> $HOME/.bash_profile source $HOME/.bash_profile # Load the kubectl completion code for zsh[1] into the current shell source <(kubectl completion zsh)
pt_br: # Instala o auto completar do bash no Mac utilizando homebrew brew install bash-completion printf " # Bash completion support source $(brew —prefix)/etc/bash_completion " >> $HOME/.bash_profile source $HOME/.bash_profile # Carrega o código de auto complentar do kubectl para o bash no shell corrente source <(kubectl completion bash) # Escreve o código de autocompletar do bash no arquivo de perfil e faz o source se é para o .bash_profile kubectl completion bash > ~/.kube/completion.bash.inc printf " # Kubectl shell completion source '$HOME/.kube/completion.bash.inc' " >> $HOME/.bash_profile source $HOME/.bash_profile # Carrega o código de auto complentar do kubectl para zsh[1] no shell em utilização source <(kubectl completion zsh)

source: # List all pods in ps output format. kubectl get pods # List all pods in ps output format with more information (such as node name). kubectl get pods -o wide # List a single replication controller with specified NAME in ps output format. kubectl get replicationcontroller web # List a single pod in JSON output format. kubectl get -o json pod web-pod-13je7 # List a pod identified by type and name specified in "pod.yaml" in JSON output format. kubectl get -f pod.yaml -o json # Return only the phase value of the specified pod. kubectl get -o template pod/web-pod-13je7 --template={{.status.phase}} # List all replication controllers and services together in ps output format. kubectl get rc,services # List one or more resources by their type and names. kubectl get rc/web service/frontend pods/web-pod-13je7 # List all resources with different types. kubectl get all
pt_br: # Lista todos os pods no formato de saída ps. kubectl get pods # Lista todos os pods no formato de saída ps com mais informações (como o nome do node). kubectl get pods -o wide # Lista um único replication controller com o nome especificado no formato de saída ps kubectl get replicationcontroller web # Lista um único pod e usa o formato de saída JSON. kubectl get -o json pod web-pod-13je7 # Lista o pod identificado com o tipo e nome especificado no "pod.yaml" e usa o formato de saída JSON. kubectl get -f pod.yaml -o json # Mostra apenas em que estágio o pod especificado está. kubectl get -o template pod/web-pod-13je7 —template={{.status.phase}} # Lista todos os replication controllers e services juntos no formato de saída ps. kubectl get rc,services # Lista um ou mais recursos pelo seu tipo e nomes. kubectl get rc/web service/frontend pods/web-pod-13je7 # Lista todos os recursos e com tipos diferentes. kubectl get all

source: # Listen on ports 5000 and 6000 locally, forwarding data to/from ports 5000 and 6000 in the pod kubectl port-forward mypod 5000 6000 # Listen on port 8888 locally, forwarding to 5000 in the pod kubectl port-forward mypod 8888:5000 # Listen on a random port locally, forwarding to 5000 in the pod kubectl port-forward mypod :5000 # Listen on a random port locally, forwarding to 5000 in the pod kubectl port-forward mypod 0:5000
pt_br: # Escuta nas portas locais 5000 e 6000, e redireciona os dados de/para as portas 5000 e 6000 no pod kubectl port-forward mypod 5000 6000 # Escuta na porta local 8888 localmente, e redireciona para a porta 5000 no pod kubectl port-forward mypod 8888:5000 # Escuta uma porta local aleatória, e redireciona para a porta 5000 no pod kubectl port-forward mypod :5000 # Escuta uma porta local aleatória, e redireciona para a porta 5000 no pod\n kubectl port-forward mypod 0:5000

source: # Mark node "foo" as schedulable. $ kubectl uncordon foo
pt_br: # Remove a restrição de execução de Pods no node "foo". $ kubectl uncordon foo

source: # Mark node "foo" as unschedulable. kubectl cordon foo
pt_br: # Restringe a execução de novos Pods no node "foo". kubectl cordon foo
