Repository: HSQ-Q/kube-MSRM
Catalog: translations/kubectl/*/LC_MESSAGES/k8s.po
Languages: pt_br

source: # Partially update a node using strategic merge patch kubectl patch node k8s-node-1 -p '{"spec":{"unschedulable":true}}' # Partially update a node identified by the type and name specified in "node.json" using strategic merge patch kubectl patch -f node.json -p '{"spec":{"unschedulable":true}}' # Update a container's image; spec.containers[*].name is required because it's a merge key kubectl patch pod valid-pod -p '{"spec":{"containers":[{"name":"kubernetes-serve-hostname","image":"new image"}]}}' # Update a container's image using a json patch with positional arrays kubectl patch pod valid-pod --type='json' -p='[{"op": "replace", "path": "/spec/containers/0/image", "value":"new image"}]'
pt_br: # Atualiza parcialmente um node utilizando a estratégia merge patch kubectl patch node k8s-node-1 -p '{"spec":{"unschedulable":true}}' # Atualiza parcialmente um node identificado pelo tipo e nome no arquivo "node.json" utilizando a estratégia merge patch kubectl patch -f node.json -p '{"spec":{"unschedulable":true}}' # Atualiza uma imagem em um container; spec.containers[*].name é requerido pois será usado como índice para a mudança kubectl patch pod valid-pod -p '{"spec":{"containers":[{"name":"kubernetes-serve-hostname","image":"new image"}]}}' # Atualiza uma imagem em um container utilizando o json patch com positional arrays kubectl patch pod valid-pod —type='json' -p='[{"op": "replace", "path": "/spec/containers/0/image", "value":"new image"}]'

source: # Print flags inherited by all commands kubectl options
pt_br: # Mostra as opções herdadas por todos os comandos kubectl options

source: # Print the address of the master and cluster services kubectl cluster-info
pt_br: # Mostra o endereço do servidor de gerenciamento e dos serviços do cluster kubectl cluster-info

source: # Print the client and server versions for the current context kubectl version
pt_br: # Imprime a versão do cliente e do servidor para o contexto atual kubectl version

source: # Print the supported API versions kubectl api-versions
pt_br: # Mostra as versões de API suportadas kubectl api-versions

source: # Replace a pod using the data in pod.json. kubectl replace -f ./pod.json # Replace a pod based on the JSON passed into stdin. cat pod.json | kubectl replace -f - # Update a single-container pod's image version (tag) to v4 kubectl get pod mypod -o yaml | sed 's/\(image: myimage\):.*$/:v4/' | kubectl replace -f - # Force replace, delete and then re-create the resource kubectl replace --force -f ./pod.json
pt_br: # Substitui um pod utlizando os dados contidos em pod.json. kubectl replace -f ./pod.json # Troca um pod com base no JSON fornecido no stdin. cat pod.json | kubectl replace -f - # Atualiza uma versão de imagem (tag) de um pod com um único container para v4 kubectl get pod mypod -o yaml | sed 's/\(image: myimage\):.*$/:v4/' | kubectl replace -f - # Força a troca, removendo e recriando o recurso kubectl replace —force -f ./pod.json

source: # Return snapshot logs from pod nginx with only one container kubectl logs nginx # Return snapshot logs for the pods defined by label app=nginx kubectl logs -lapp=nginx # Return snapshot of previous terminated ruby container logs from pod web-1 kubectl logs -p -c ruby web-1 # Begin streaming the logs of the ruby container in pod web-1 kubectl logs -f -c ruby web-1 # Display only the most recent 20 lines of output in pod nginx kubectl logs --tail=20 nginx # Show all logs from pod nginx written in the last hour kubectl logs --since=1h nginx # Return snapshot logs from first container of a job named hello kubectl logs job/hello # Return snapshot logs from container nginx-1 of a deployment named nginx kubectl logs deployment/nginx -c nginx-1
pt_br: # Retorna os logs do pod nginx com um único container kubectl logs nginx # Retorna os logs dos pods definidos pelo label app=nginx kubectl logs -lapp=nginx # Retorna os logs do container ruby finalizado do pod web-1 kubectl logs -p -c ruby web-1 # Começa o streaming de logs de um ruby container no pod web-1 kubectl logs -f -c ruby web-1 # Mostra apenas as 20 linhas mais recentes de saída do pod nginx kubectl logs —tail=20 nginx # Mostra todos os logs do pod nginx escrito na última hora kubectl logs —since=1h nginx # Retorna os logs do primeiro container com o Job chamado hello kubectl logs job/hello # Retorna os logs do container nginx-1 de um deployment chamado nginx kubectl logs deployment/nginx -c nginx-1

source: # Run a proxy to kubernetes apiserver on port 8011, serving static content from ./local/www/ kubectl proxy --port=8011 --www=./local/www/ # Run a proxy to kubernetes apiserver on an arbitrary local port. # The chosen port for the server will be output to stdout. kubectl proxy --port=0 # Run a proxy to kubernetes apiserver, changing the api prefix to k8s-api # This makes e.g. the pods api available at localhost:8001/k8s-api/v1/pods/ kubectl proxy --api-prefix=/k8s-api
pt_br: # Executa um proxy para o apiserver do kubernetes na porta 8011, servindo um conteúdo estático do caminho ./local/www/ kubectl proxy —port=8011 —www=./local/www/ # Executa um proxy para o apiserver do kubernetes em uma porta local arbitrária. # A porta escolhida para o servidor será utilizada para o saída de stdout. kubectl proxy —port=0 # Executa um proxy para o apiserver do kubernetes, mudando o prefixo do api para k8s-api # Com isso a api dos pods estarão disponível em localhost:8001/k8s-api/v1/pods/ kubectl proxy —api-prefix=/k8s-api

source: # Scale a replicaset named 'foo' to 3. kubectl scale --replicas=3 rs/foo # Scale a resource identified by type and name specified in "foo.yaml" to 3. kubectl scale --replicas=3 -f foo.yaml # If the deployment named mysql's current size is 2, scale mysql to 3. kubectl scale --current-replicas=2 --replicas=3 deployment/mysql # Scale multiple replication controllers. kubectl scale --replicas=5 rc/foo rc/bar rc/baz # Scale job named 'cron' to 3. kubectl scale --replicas=3 job/cron
pt_br: # Escala um replicaset chamado 'foo' para 3. kubectl scale —replicas=3 rs/foo # Escala um recurso identificado pelo tipo e nome especificado no arquivo "foo.yaml" para 3. kubectl scale —replicas=3 -f foo.yaml # Se um deployment chamado mysql tem tamanho 2, escala o mysql para 3. kubectl scale —current-replicas=2 —replicas=3 deployment/mysql # Escala múltiplos replication controllers. kubectl scale —replicas=5 rc/foo rc/bar rc/baz # Escala um Job chamado 'cron' para 3. kubectl scale —replicas=3 job/cron

source: # Set the last-applied-configuration of a resource to match the contents of a file. kubectl apply set-last-applied -f deploy.yaml # Execute set-last-applied against each configuration file in a directory. kubectl apply set-last-applied -f path/ # Set the last-applied-configuration of a resource to match the contents of a file, will create the annotation if it does not already exist. kubectl apply set-last-applied -f deploy.yaml --create-annotation=true
pt_br: # Ajusta o last-applied-configuration de um recurso para corresponder ao conteúdo de um arquivo. kubectl apply set-last-applied -f deploy.yaml # Executa o set-last-applied em todos os arquivos de configuração no diretório. kubectl apply set-last-applied -f path/ # Ajusta o last-applied-configuration de um recurso para corresponder ao conteúdo de um arquivo, será criada uma annotation se esta ainda não existe. kubectl apply set-last-applied -f deploy.yaml —create-annotation=true

source: # Show metrics for all pods in the default namespace kubectl top pod # Show metrics for all pods in the given namespace kubectl top pod --namespace=NAMESPACE # Show metrics for a given pod and its containers kubectl top pod POD_NAME --containers # Show metrics for the pods defined by label name=myLabel kubectl top pod -l name=myLabel
pt_br: # Mostra as métricas para todos os pods no namespace default kubectl top pod # Mostra as métricas para todos os pods em um dado namespace kubectl top pod —namespace=NAMESPACE # Mostra as métricas para um dado pod e seus containers kubectl top pod POD_NAME —containers # Mostra as métricas para os pods definidos pelo label name=myLabel kubectl top pod -l name=myLabel

source: # Shut down foo. kubectl stop replicationcontroller foo # Stop pods and services with label name=myLabel. kubectl stop pods,services -l name=myLabel # Shut down the service defined in service.json kubectl stop -f service.json # Shut down all resources in the path/to/resources directory kubectl stop -f path/to/resources
pt_br: # Termina o replicationcontroller foo. kubectl stop replicationcontroller foo # Para os pods e serviços com o label name=myLabel. kubectl stop pods,services -l name=myLabel # Termina o serviço definido no arquivo service.json kubectl stop -f service.json # Termina todos os recursos no caminho do diretório path/to/resources kubectl stop -f path/to/resources

source: # Start a single instance of nginx. kubectl run nginx --image=nginx # Start a single instance of hazelcast and let the container expose port 5701 . kubectl run hazelcast --image=hazelcast --port=5701 # Start a single instance of hazelcast and set environment variables "DNS_DOMAIN=cluster" and "POD_NAMESPACE=default" in the container. kubectl run hazelcast --image=hazelcast --env="DNS_DOMAIN=cluster" --env="POD_NAMESPACE=default" # Start a replicated instance of nginx. kubectl run nginx --image=nginx --replicas=5 # Dry run. Print the corresponding API objects without creating them. kubectl run nginx --image=nginx --dry-run # Start a single instance of nginx, but overload the spec of the deployment with a partial set of values parsed from JSON. kubectl run nginx --image=nginx --overrides='{ "apiVersion": "v1", "spec": { ... } }' # Start a pod of busybox and keep it in the foreground, don't restart it if it exits. kubectl run -i -t busybox --image=busybox --restart=Never # Start the nginx container using the default command, but use custom arguments (arg1 .. argN) for that command. kubectl run nginx --image=nginx -- <arg1> <arg2> ... <argN> # Start the nginx container using a different command and custom arguments. kubectl run nginx --image=nginx --command -- <cmd> <arg1> ... <argN> # Start the perl container to compute π to 2000 places and print it out. kubectl run pi --image=perl --restart=OnFailure -- perl -Mbignum=bpi -wle 'print bpi(2000)' # Start the cron job to compute π to 2000 places and print it out every 5 minutes. kubectl run pi --schedule="0/5 * * * ?" --image=perl --restart=OnFailure -- perl -Mbignum=bpi -wle 'print bpi(2000)'
pt_br: # Inicia uma única instância de nginx. kubectl run nginx —image=nginx # Inicia uma única instância do hazelcast e expõe a porta 5701 do container. kubectl run hazelcast —image=hazelcast —port=5701 # Inicia uma única instância do hazelcast e seta as variáveis de ambiente "DNS_DOMAIN=cluster" e "POD_NAMESPACE=default" no container. kubectl run hazelcast —image=hazelcast —env="DNS_DOMAIN=cluster" —env="POD_NAMESPACE=default" # Inicia uma instância replicada de nginx. kubectl run nginx —image=nginx —replicas=5 # Dry run. Mostra os objetos da API correspondente sem criar elas. kubectl run nginx —image=nginx —dry-run # Inicia uma única instância de nginx, mas sobrescreve a spec do deployment com um conjunto parcial de valores passeados do JSON. kubectl run nginx —image=nginx —overrides='{ "apiVersion": "v1", "spec": { … } }' # Inicia um pod de busybox e mantém ele em primeiro plano, não reinicia se ele já existe. kubectl run -i -t busybox —image=busybox —restart=Never # Inicia um container nginx usando o comando padrão, mas utiliza argumentos customizados (arg1 .. argN) para o comando. kubectl run nginx —image=nginx — <arg1> <arg2> … <argN> # Inicia um container nginx usando um comando diferente e argumentos customizados. kubectl run nginx —image=nginx —command — <cmd> <arg1> … <argN> # Inicia um container perl para processar π to 2000 posições e mostra a saída. kubectl run pi —image=perl —restart=OnFailure — perl -Mbignum=bpi -wle 'print bpi(2000)' # Inicia um cron job para processar as 2000 posições de π e mostra a saída a cada 5 minutos. kubectl run pi —schedule="0/5 * * * ?" —image=perl —restart=OnFailure — perl -Mbignum=bpi -wle 'print bpi(2000)'

source: # Update node 'foo' with a taint with key 'dedicated' and value 'special-user' and effect 'NoSchedule'. # If a taint with that key and effect already exists, its value is replaced as specified. kubectl taint nodes foo dedicated=special-user:NoSchedule # Remove from node 'foo' the taint with key 'dedicated' and effect 'NoSchedule' if one exists. kubectl taint nodes foo dedicated:NoSchedule- # Remove from node 'foo' all the taints with key 'dedicated' kubectl taint nodes foo dedicated-
pt_br: # Atualiza a restrição para a chave 'dedicated' e o valor 'special-user' e o efeito 'NoSchedule' para o node 'foo'. # Se o taint com esta chave e efeito já existirem, o seu valor é substituído pelo especificado. kubectl taint nodes foo dedicated=special-user:NoSchedule # Remove a restrição com a chave 'dedicated' e efeito 'NoSchedule' do nodo 'foo' se existir. kubectl taint nodes foo dedicated:NoSchedule- # Remove o node 'foo' todos os taints com a chave 'dedicated' kubectl taint nodes foo dedicated-

source: # Update pod 'foo' with the label 'unhealthy' and the value 'true'. kubectl label pods foo unhealthy=true # Update pod 'foo' with the label 'status' and the value 'unhealthy', overwriting any existing value. kubectl label --overwrite pods foo status=unhealthy # Update all pods in the namespace kubectl label pods --all status=unhealthy # Update a pod identified by the type and name in "pod.json" kubectl label -f pod.json status=unhealthy # Update pod 'foo' only if the resource is unchanged from version 1. kubectl label pods foo status=unhealthy --resource-version=1 # Update pod 'foo' by removing a label named 'bar' if it exists. # Does not require the --overwrite flag. kubectl label pods foo bar-
pt_br: # Atualiza o pod 'foo' com o label 'unhealthy' e valor 'true'. kubectl label pods foo unhealthy=true # Atualiza o pod 'foo' com o label 'status' e valor 'unhealthy', sobrescrevendo qualquer valor existente. kubectl label —overwrite pods foo status=unhealthy # Atualiza todos os pods no namespace corrente kubectl label pods —all status=unhealthy # Atualiza o pod identificado pelo tipo e nome em "pod.json" kubectl label -f pod.json status=unhealthy # Atualiza o pod 'foo' apenas se o recurso não foi modificado na versão 1. kubectl label pods foo status=unhealthy —resource-version=1 # Atualiza o pod 'foo' removendo o label chamado 'bar', se ele existir. # Não necessita a flag —overwrite. kubectl label pods foo bar-

source: # Update pods of frontend-v1 using new replication controller data in frontend-v2.json. kubectl rolling-update frontend-v1 -f frontend-v2.json # Update pods of frontend-v1 using JSON data passed into stdin. cat frontend-v2.json | kubectl rolling-update frontend-v1 -f - # Update the pods of frontend-v1 to frontend-v2 by just changing the image, and switching the # name of the replication controller. kubectl rolling-update frontend-v1 frontend-v2 --image=image:v2 # Update the pods of frontend by just changing the image, and keeping the old name. kubectl rolling-update frontend --image=image:v2 # Abort and reverse an existing rollout in progress (from frontend-v1 to frontend-v2). kubectl rolling-update frontend-v1 frontend-v2 --rollback
pt_br: # Atualiza os pods de frontend-v1 utilizando os dados do novo replication controller definido em frontend-v2.json. kubectl rolling-update frontend-v1 -f frontend-v2.json # Atualiza os pods do frontend-v1 utilizando os dados em JSON passados pelo stdin. cat frontend-v2.json | kubectl rolling-update frontend-v1 -f - # Atualiza os pods do frontend-v1 para frontend-v2 trocando a imagem, e trocando o # nome do replication controller. kubectl rolling-update frontend-v1 frontend-v2 --image=image:v2 # Atualiza os pods do frontend trocando a imagem, e mantendo o nome antigo. kubectl rolling-update frontend --image=image:v2 # Cancela e reverte um rollout existente em progresso (de frontend-v1 para frontend-v2). kubectl rolling-update frontend-v1 frontend-v2 --rollback

source: # View the last-applied-configuration annotations by type/name in YAML. kubectl apply view-last-applied deployment/nginx # View the last-applied-configuration annotations by file in JSON kubectl apply view-last-applied -f deploy.yaml -o json
pt_br: # Visualiza a anotação last-applied-configuration pelo tipo/nome no YAML. kubectl apply view-last-applied deployment/nginx # Visualiza a anotação last-applied-configuration no arquivo JSON kubectl apply view-last-applied -f deploy.yaml -o json

source: Apply a configuration to a resource by filename or stdin. This resource will be created if it doesn't exist yet. To use 'apply', always create the resource initially with either 'apply' or 'create --save-config'. JSON and YAML formats are accepted. Alpha Disclaimer: the --prune functionality is not yet complete. Do not use unless you are aware of what the current state is. See https://issues.k8s.io/34274.
pt_br: Aplica a configuração em um recurso usando um nome de arquivo ou stdin. Este recurso será criado se ele não existir. Para utilizar o 'apply', sempre crie o recurso inicialmente com 'apply' ou 'create --save-config'. Formatos JSON e YAML são aceitos. Nota Alpha: a funcionalidade --prune não está completa. Não utilize a não ser que você saibe qual é o estado corrente. Veja https://issues.k8s.io/34274.

source: Convert config files between different API versions. Both YAML and JSON formats are accepted. The command takes filename, directory, or URL as input, and convert it into format of version specified by --output-version flag. If target version is not specified or not supported, convert to latest version. The default output will be printed to stdout in YAML format. One can use -o option to change to output destination.
pt_br: Convert os arquivos de configuração para diferentes versões de API. Ambos formatos YAML \e JSON são aceitos. O command recebe o nome do arquivo, diretório ou URL como entrada, e converteno formato para a versão especificada pelo parametro —output-version. Se a versão desejada não é especificada ou não é suportada, converte para a última versã disponível. A saída padrão é no formato YAML. Pode ser utilizadoa opção -o para mudar o formato de saída.

source: Create a ClusterRole.
pt_br: Cria um ClusterRole.

source: Create a ClusterRoleBinding for a particular ClusterRole.
pt_br: Cria um ClusterRoleBinding para um ClusterRole específico.

source: Create a RoleBinding for a particular Role or ClusterRole.
pt_br: Cria uma RoleBinding para uma Role específica ou ClusterRole.

source: Create a TLS secret from the given public/private key pair. The public/private key pair must exist before hand. The public key certificate must be .PEM encoded and match the given private key.
pt_br: Cria um TLS secret de uma chave pública/privada fornecida. A chave pública/privada deve existir antes. O certificado da chave deve ser codificada como PEM, e ter sido gerada pela chave privada.

source: Create a configmap based on a file, directory, or specified literal value. A single configmap may package one or more key/value pairs. When creating a configmap based on a file, the key will default to the basename of the file, and the value will default to the file content. If the basename is an invalid key, you may specify an alternate key. When creating a configmap based on a directory, each file whose basename is a valid key in the directory will be packaged into the configmap. Any directory entries except regular files are ignored (e.g. subdirectories, symlinks, devices, pipes, etc).
pt_br: Cria um configmap com base em um arquivo, diretório, ou um valor literal especificado. Um configmap único pode conter um ou mais pares de chave/valor. Quando criar um configmap com base em um arquivo, a chave será por padrão o nome do arquivo, e o valor será por padrão o conteúdo do arquivo. Se o nome do arquivo for uma chave inválida, você deve especificar uma chave alternativa. Quando criar um configmap com base em um diretório, cada arquivo cujo o nome é uma chave válida no diretório será colocada no configmap. Qualquer entrada de diretório, exceto as com arquivos válidos serão ignorados (por exemplo: sub-diretórios, symlinks, devices, pipes, etc).

source: Create a namespace with the specified name.
pt_br: Cria um namespace com um nome especificado.

source: Create a new secret for use with Docker registries. Dockercfg secrets are used to authenticate against Docker registries. When using the Docker command line to push images, you can authenticate to a given registry by running $ docker login DOCKER_REGISTRY_SERVER --username=DOCKER_USER --password=DOCKER_PASSWORD --email=DOCKER_EMAIL'. That produces a ~/.dockercfg file that is used by subsequent 'docker push' and 'docker pull' commands to authenticate to the registry. The email address is optional. When creating applications, you may have a Docker registry that requires authentication. In order for the nodes to pull images on your behalf, they have to have the credentials. You can provide this information by creating a dockercfg secret and attaching it to your service account.
pt_br: Cria um novo secret para utilizar com Docker registries. Dockercfg secrets são utilizados para autenticar Docker registries. Quando utilizando a linha de comando do Docker para realizar envio das images, você pode se autenticar para um registro fornecido executando $ docker login DOCKER_REGISTRY_SERVER —username=DOCKER_USER —password=DOCKER_PASSWORD —email=DOCKER_EMAIL'. Isso irá gerar um arquivo ~/.dockercfg que será utilizado para os comandos 'docker push' e 'docker pull' se autenticarem no registro. O endereço de email é opcional. Quando criar aplicações, você pode ter um Docker registry que requer autenticação. Para que os nodes possam baixar as imagens em seu nome, eles devem ter as credenciais. Você pode prover esta informação criando um dockercfg secret e anexando-o à sua conta de serviço.

source: Create a pod disruption budget with the specified name, selector, and desired minimum available pods
pt_br: Cria um pod disruption budget com o nome especificado, seletor, e o número mínimo de pode disponíveis

source: Create a resource by filename or stdin. JSON and YAML formats are accepted.
pt_br: Cria um recurso por nome de arquivo ou stdin. Os formatos JSON e YAML são aceitos.

source: Create a resourcequota with the specified name, hard limits and optional scopes
pt_br: Cria um resourcequota com o nome especificado, limits rigídos e escopo opcional

source: Create a role with single rule.
pt_br: Cria uma role com uma única regra.
